'use client'
import parse from 'html-react-parser'
import React, { useState } from 'react'

const ArtGallery = () => {
    const [img, setimg] = useState(1)
    const text = [
        `<p>कृष्णकृपामूर्ति</p>
        <h1 className='text-xl font-semibold'>श्री श्रीमद् ए. सी. भक्तिवेदान्त स्वामी प्रभुपाद</h1>
        <p>अन्तर्राष्ट्रीय कृष्णभावनामृत संघ के संस्थापक आचार्य एवं सम्पूर्ण विश्व में वैदिक ज्ञान के अद्वितीय प्रचारक</p>`,
        `<h1 className='text-xl font-semibold'>श्रील भक्तिसिद्धान्त सरस्वती गोस्वामी महाराज</h1>
                <p>श्रील ए. सी भक्तिवेदान्त स्वामी प्रभुपाद के आध्यात्मिक गुरू</p>`,
        `<h1 className='text-xl font-semibold'>श्रील गौरकिशोर दास बाबाजी महाराज</h1>
                <p>श्रील भक्तिसिद्धान्त सरस्वती गोस्वामी महाराज के आध्यात्मिक गुरू और श्रील भक्तिविनोद ठाकुर के अन्तरंग शिष्य</p>`,
        `<h1 className='text-xl font-semibold'>श्रील भक्तिविनोद ठाकुर</h1>
                <p>कृष्णभावनामृत से सम्पूर्ण जगत को लाभान्वित कराने वाले कार्यक्रम के प्रणेता</p>`,
        `<h1 className='text-xl font-semibold'>श्रील जगन्नाथ दास बाबाजी महाराज</h1>
                <p>श्रील भक्तिविनोद ठाकुर के आध्यात्मिक गुरू</p>`,
        "<p>इस कलियुग में जो लोग पर्याप्त बुद्धिमान हैं, वे भगवान् की उनके पार्षदों सहित संकीर्तन-यज्ञ द्वारा पूजा करेंगे । (३.१० तात्पर्य)</p>",
        "<p>धृतराष्ट्र ने कहाः हे संजय ! धर्मभूमि कुरूक्षेत्र में युद्ध की इच्छा से हुए मेरे तथा पाण्डु के पुत्रों ने क्या किया ? (१.१)</p>",
        "<p>जिस प्रकार मनुष्य पुराने वस्त्रों को त्यागकर नये वस्त्र धारण करता है, उसी प्रकार आत्मा पुराने तथा व्यर्थ के शरीरों को त्यागकर नवीन भौतिक शरीर धारण करता है। (२.२२)</p>",
        "<p>प्रत्येक व्यक्ति इस भौतिक शरीर रूपी रथ पर आरूढ है और बुद्धि इसका सारथी है। मन लगाम है तथा इन्द्रियाँ घोड़े हैं। इस प्रकार मन तथा इन्द्रियों की संगति से यह आत्मा सुख या दुःख का भोक्ता है। (६.३४ तात्पर्य)</p>",
        "<p>संसार के सारे भौतिक कार्यकलाप प्रकृति के तीन गुणों के अधीन सम्पन्न होते है। यद्यपि प्रकृति के तीन गुण परमेश्वर कृष्ण से उद्भुत हैं, फिर भी भगवान् कृष्ण उनके अधीन नहीं होते (७.१२ तात्पर्य)</p>",
        "<p>जो निपट मूर्ख हैं, जो मनुष्यों में अधम हैं, जिनका ज्ञान माया द्वारा हर लिया गया है तथा जो असुरों की नास्तिक प्रकृति को धारण करने वाले हैं, ऐसे दुष्ट मेरी शरण ग्रहण नहीं करते और चार प्रकार के पुण्यात्मा मेरी सेवा करते हैं-आर्त, जिज्ञासु, अर्थार्थी तथा ज्ञानी। (७.१५-१६)",
        "<p>योग में सिद्ध योगी अपने शरीर को त्यागने के स्थान तथा समय की व्यवस्था कर सकते हैं । अन्य मनुष्यों का इस पर कोई वश नहीं होता। (८.२४ तात्पर्य)</p>",
        "<p>ऐसे अनेक जीव हैं जो दुष्टों को दण्ड देते हैं, किन्तु इनमें यमराज प्रमुख हैं। यमराज पृथ्वीलोक के निकटवर्ती लोक में रहते हैं। मृत्यु के बाद पापी लोगों</p>",
        "<p>को वहाँ ले जाया जाता है और यमराज उन्हें तरह-तरह का दण्ड देने की व्यवस्था करते हैं। (१०.२९ तात्पर्य)</p>",
        "<p>मैं समस्त आध्यात्मिक तथा भौतिक जगतों का कारण हूँ, प्रत्येक वस्तु मुझ ही से उद्भूत है। जो बुद्धिमान यह भलीभांति जानते हैं, वे मेरी प्रेमाभक्ति में लगते हैं तथा हृदय से पूरी तरह मेरी पूजा में तत्पर होते हैं। (१०.८)</p>",
        '<p>विश्वरूप दर्शन कर स्तब्ध हुए अर्जुन ने कहाँ, "हे विश्वेश्वर, हे विश्वरूप। मैं आपके शरीर में अनेकानेक हाथ, पेट, मुख तथा आँखें देख रहा हूँ, जो सर्वत्र फैले हुए हैं और जिनका अन्त नहीं है। आप में न अन्त दिखता है, न मध्य और न आदि।" (११.१६)</p>',
        "<p>भौतिक जगत् रूपी वृक्ष आध्यात्मिक जगत् रूपी वास्तविक वृक्ष का प्रतिबिम्ब मात्र है। इस भौतिक जगत् रूपी वृक्ष में आसक्त रहने वाले मनुष्य की मुक्ति की कोई सम्भावना नहीं होती। लेकिन जो मनुष्य आध्यात्मिक जगत् रूपी वृक्ष को समझ लेता है, वह आत्मोन्नति कर सकता है। (१५.१ तात्पर्य)</p>",
        "<p>मैं प्रत्येक जीव के हृदय में आसीन हूँ और मुझ से ही स्मृति, ज्ञान तथा विस्मृति होती है। मैं ही वेदों के द्वारा जानने योग्य हूँ। निःसन्देह मैं वेदान्त का संकलनकर्ता तथा समस्त वेदों को जानने वाला हूँ।(१५.१५)</p>",
        "<p>आहार भौतिक प्रकृति के तीन गुणों के अनुसार तीन प्रकार का होता है। सात्त्विक भोजन रसमय, स्निग्ध, स्वास्थ्यप्रद होता है। अत्यधिक तीखे, खट्टे, नमकीन, गरम, चटपटे, शुष्क तथा जलन उत्पन्न करने वाले भोजन रजोगुणी व्यक्तियों को प्रिय होते हैं। स्वादहीन, वियोजित एवं सड़ा, जूठा तथा अस्पृश्य वस्तुओं से युक्त भोजन तामसिक होता है। (१७.८-१०)</p>",
        "<p>कम बुद्धि वाले व्यक्ति देवताओं से अनुग्रह पाने की आशा करते हैं और ऐसी वस्तुएँ प्राप्त करते हैं, जो अस्थायी होती हैं और मृत्यु के समय समाप्त हो जाती हैं । वास्तव में ये सारे लाभ भगवान् द्वारा ही प्रदान किये जाते हैं। (७.२२ तात्पर्य)</p>",
        "<p>यदि जीव ने अपनी चेतना पशु जैसी बना रखी है, तो उसे पशु का शरीर प्राप्त होना निश्चित है। (१५.९ तात्पर्य)</p>",
        "<p>सदैव मेरा चिन्तन करो, मेरे भक्त बनो, मेरी पूजा करो और मुझे नमस्कार करो। इस प्रकार तुम निश्चित रूप से मेरे पास आओगे। मैं तुम्हें वचन देता हूँ, क्योंकि तुम मेरे परम प्रिय मित्र हो। (१८.६५)</p>",

    ]
    return (
        <div className='h-screen w-full p-5'>
            <div className='h-100 w-full rounded-2xl overflow-hidden flex justify-center items-center'>
                <img src={`/general/${img}.jpeg`} className='object-contain w-full rounded-2xl' alt="1" />
            </div>
            <div className='text-center my-2 w-full'>
                {parse(text[img-1])}
            </div>
            <div className="join grid grid-cols-3 w-full">
                <button onClick={() => setimg(img - 1)} className="join-item btn btn-outline" disabled={img - 1 <= 0}>{`<< `}Art {img - 1}</button>
                <div className="join-item btn btn-outline">Art {img}</div>
                <button onClick={() => setimg(img + 1)} className="join-item btn btn-outline" disabled={img + 1 >= 23}>Art {` ${img + 1} >>`}</button>
            </div>
        </div>
    )
}

export default ArtGallery
